Revit 2018 API
DWFXExportOptions Properties
The DWFXExportOptions type exposes the following members.
Properties
Name | Description
CropBoxVisible
Whether to export crop box.
 (Inherited from DWFExportOptions.)
ExportingAreas
Whether to also export areas and rooms' geometry.
 (Inherited from DWFExportOptions.)
ExportObjectData
Whether to include properties associated with elements.
 (Inherited from DWFExportOptions.)
ExportTexture
Whether to export texture.
 (Inherited from DWFExportOptions.)
ImageFormat
Controls the compression level of images embedded.
 (Inherited from DWFExportOptions.)
ImageQuality
Image quality level when compressed raster format(JPEG) is used.
 (Inherited from DWFExportOptions.)
MergedViews
Whether to merge all views in one file.
 (Inherited from DWFExportOptions.)
PaperFormat
Standard paper format.
 (Inherited from DWFExportOptions.)
PortraitLayout
Paper orientation - Portrait/Landscape.
 (Inherited from DWFExportOptions.)
StopOnError
Whether export process should stop when a view fails to export.
 (Inherited from DWFExportOptions.)
See Also
DWFXExportOptions Class
Autodesk.Revit.DB Namespace